# کارگاه پایگاه داده با پایتون دانشگاه تربیت مدرس



تهیه تنظیم : محمد مهدی خرسند اعلم

# فراخوانی کتابخانه mysql

In [3]:
import mysql.connector

## ایجاد ارتباط با سرور دیتابیس به جهت خواندن اطلاعات و دیتا ها 



دقت داشته باشید که دراینجا سرور ما همان سرور سیستم عامل خودمان است  ایپی این سرور به شکل زیر است:
127.0.0.1
به معنی home و یا localhost

In [6]:
mydb = mysql.connector.connect(
  host="localhost",
  user="Wizard",
  password="Sohrabi_17622",

)

### ایجاد یک کرسر برای مشخص کردن دیتابیس

انتخاب یک دیتابیس (شبیه کیلیک کردن)

In [7]:
mycursor = mydb.cursor()

## ایجاد یک دیتابیس جدید

CREATE DATABASE -> دستور ساخت دیتابیس

در ادامه اسم مورد نظر -> tarbiatmodares

In [8]:
mycursor.execute("CREATE DATABASE tarbiatmodares")

## نمایش دیتابیس های موجود

برای نمایش دیتابیس های موجود در سرور از این دستور استفاده میکنم -> mycursor.execute("SHOW DATABASES")


حلفه زده شده برای نمایش تمام دیتاها

In [9]:

mycursor.execute("SHOW DATABASES")

for x in mycursor:
  print(x)

('information_schema',)
('mysql',)
('performance_schema',)
('sys',)
('tarbiatmodares',)

## ایجاد و حذف دیتابیس خاص

با دستور -> DROP DATABASE

In [37]:
mycursor.execute("CREATE DATABASE test2")

In [38]:

mycursor.execute("SHOW DATABASES")

for x in mycursor:
  print(x)

('information_schema',)
('mydatabase',)
('mysql',)
('performance_schema',)
('sys',)
('tarbiatmodares',)
('test1',)

### حذف دیتابیس -> test1

In [39]:
mycursor.execute("DROP DATABASE test2")

In [40]:

mycursor.execute("SHOW DATABASES")

for x in mycursor:
  print(x)

('information_schema',)
('mydatabase',)
('mysql',)
('performance_schema',)
('sys',)
('tarbiatmodares',)

### اتصال به دیتابیس مورد نظر

در اینجا ما به به دیتابیس tarbiatmodares متصل میشویم

In [74]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="10401040",
  database="tarbiatmodares"
)

بردن کرسر بر روی دیتابیس جدید خونده شده

In [75]:
mycursor = mydb.cursor()

برای نمایش جدول های این دیتابیس از این دستور استفاده میکنیم -> SHOW TABLES

In [76]:
mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('students',)

‍

# ایجاد یک جدول جدید در دیتابیس



<font color='#FC8A00'> CREATE TABLE  </font>	


ابتدا با دستور یک جدول جدید ایجاد میکنیم سپس نام و نام ستون ها و نوع دیتای مورد پذیرش را معرفی میکنم

 سه نوع اصلی داده وجود دارد: نوع متنی، نوع عددی و نوع تارخ/زمان

## داده های متنی


<font color='#008CBA'> CHAR(size) </font>	-> رشته ای با طول ثابت (می تواند شامل حروف، اعداد و کاراکترهای خاص باشد)

طول رشته در پرانتر مشخص می شود و حداکثر 255 کاراکتر است


<font color='#008CBA'> VARCHAR(size)  </font> -> رشته ای با طول متغیر (می تواند شامل حروف، اعداد و کاراکترهای خاص باشد)

توجه: اگر رشته ای با طول بیش از 255 کاراکتر را در آن قرار دهید، به نوع داده متنی تبدیل خواهد شد -> TEXT

## داده های عددی 

<font color='#008CBA'> INT(size) </font> -> محدوده اعداد مجاز به صورت علامت دار: 2147483648- تا 2147483647 

محدوده اعداد مجاز به صورت بدون علامت: 0 تا 4294967295


<font color='#008CBA'>BIGINT(size)</font>	-> محدوده اعداد مجاز به صورت علامت دار: 9223372036854775808- تا 9223372036854775807

محدوده اعداد مجاز به صورت بدون علامت: 0 تا 18446744073709551615


<font color='#008CBA'> FLOAT(size)</font> 	 -> از این دو نوع داده برای ذخیره اعداد اعشاری با ممیز شناور استفاده می شود

پارامتر size حداکثر تعداد ارقام و پارمتر d حداکثر تعداد ارقام سمت راست ممیز اعشار را مشخص می کند


<font color='#008CBA'> DOUBLE(size,d) </font> ->پارامتر size حداکثر تعداد ارقام و پارمتر d حداکثر تعداد ارقام سمت راست ممیز اعشار را مشخص می کند

از این دو نوع داده برای ذخیره اعداد اعشاری با ممیز شناور استفاده می شود

## داده های تاریخ/زمان




<font color='#008CBA'>  DATE() </font>	->  این نوع داده برای نگهداری تاریخ (بدون ساعت)، با قالب 'YYYY-MM-DD' استفاده می شود

توجه:  محدوده تاریخی بصورت '01-01-1000' تا '31-12-9999' می باشد


<font color='#008CBA'> DATETIME() </font>	-> این نوع داده برای نگهداری زمان (هم تاریخ و هم ساعت بصورت تفکیک شده و بدون توجه به منطقه زمانی)

توجه: محدوده زمانی بصورت '00:00:00 01-01-1000' تا '23:59:59 31-12-9999' می باشد.


<font color='#008CBA'> TIME() </font>	-> ین نوع داده برای نگهداری زمان (فقط ساعت ، بدون تاریخ)، با قالب 'HH:MM:SS' یا 'HHH:MM:SS' استفاده می شود


<font color='#008CBA'> YEAR()	</font>-> ذخیره سال به فرمت: دو رقمی یا چهار رقمی

## ایجاد جدول جدید در دیتابیس


ما در این جدول سه ستون داریم که به ترتیب ستون اول برای شماره دانشجویی که یه عدد صحیح اصلا و نباید خالی بماند ـ (NOT NULL)

ستون دوم مربوط به نام خانوادگی شخص است که پر کردن این فیلد هم الزامیست

و ستون اخر اسم کوچیک هر دانشجو است که پر نکردن آن ایرادی ندارد

همچنین شماره دانشجویی در این جدول به عنوان کلید اصلی صفت این موجودیت (دانشجویان) انتخاب شده است .

In [5]:
mycursor.execute("CREATE TABLE students (SID int NOT NULL,LastName varchar(255) NOT NULL,FirstName varchar(255),PRIMARY KEY (SID));")

## حذف یک کلید اصلی

In [81]:
sql = "ALTER TABLE students DROP PRIMARY KEY;"

mycursor.execute(sql)

# اضافه کردن کلید اصلی

In [82]:
sql = "ALTER TABLE students ADD PRIMARY KEY (SID);"


mycursor.execute(sql)

چک کردن و نمایش جدول های دیتابیس

In [68]:
mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('students',)

## حذف یک جدول از دیتابیس

برای حذف یک جدول از دیتابیس از دستور -> DROP TABLE 
استفاده میکنم.

In [63]:
sql = "DROP TABLE customers"

mycursor.execute(sql)

DatabaseError: 2014 (HY000): Commands out of sync; you can't run this command now

### حذف جدول به شرط اینکه وجود داشته باشد

In [30]:
sql = "DROP TABLE IF EXISTS students"
mycursor.execute(sql)

نمایش و چک کردن جدول های دیتابیس

In [10]:
mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('students',)

## اختصاص داده به سطر و ستون های جدول دیتابیس


در اینجا در دیتابیس تربیت مدرس و در جدول دانشجویان مقدار زیر را اختصاص میدهیم

In [6]:
sql = "INSERT INTO students (SID, LastName, FirstName) VALUES (%s, %s, %s)"
val = ('4001213',"Kamali", "Hasan")
mycursor.execute(sql, val)

mydb.commit()

print(mycursor.rowcount, "record inserted.")

1 record inserted.

##### ارور به دلیل رعایت نکردن ترتیب داده های ورودی

In [14]:
sql = "INSERT INTO students (name, sid) VALUES (%s, %s)"
val = ("Hassan", "1234567") #فقط 7 رقمی
mycursor.execute(sql, val)

mydb.commit()

print(mycursor.rowcount, "record inserted.")

ProgrammingError: 1054 (42S22): Unknown column 'name' in 'field list'

### خواندن تمامی سطر های جدول دانشجویان با دستور -> SELECT

In [17]:
mycursor.execute("SELECT * FROM students")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(4001213, 'Kamali', 'Hasan')

### اضافه کردن مجموعه‌ایی از داده ها در جدول دانشجوییان به صورت لیست
استفاده از این دستور به جهت اضافه کردن لیستی از داده های تاپل ->  executemany

In [7]:
sql = "INSERT INTO students (SID, LastName, FirstName) VALUES (%s, %s, %s)"

val = [
  ('4001231','Khorsand Aalam', 'Mohammad Mahdi'),
  ('4012312','Abedi', 'Ali'),
  ('9834110','Razaghi', 'Hassan'),
  ('4021229','Rangraz', 'Mohsen'),
  ('4011231','Ahmadi', 'Sara'),
  ('4001391','Fallah', 'Bita'),
  ('4011291','Fallah', 'Raha'),
  ('9812310','Sarmad', 'Sasan'),
  ('9912310','Hatami', 'Mobina'),
  ('8912340','Afkhami', 'Behroz'),
  ('4013113','Zalnezhad', 'Mahdi'),
  ('9812319','Ghasemi', 'Parsa'),
  ('4028644','Ghasemi', 'Amir')
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.")

13 was inserted.

In [8]:
val = [
  ('Mohammad Mahdi', '4001231'),
  ('Ali', '4012312'),
  ('Hassan', '9812310'),
  ('Mohsen', '4021229'),
  ('Sara', '4011231'),
  ('Bita', '4001391'),
  ('Raha', '4011291'),
  ('Sasan', '9812310'),
  ('Mobina', '9912310'),
  ('Behroz', '8912340'),
  ('Mahdi', '4013113'),
  ('Parsa', '9812319'),
  ('Amir', '4028644')
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.")

InterfaceError: Failed executing the operation; Not enough parameters for the SQL statement

In [69]:
mycursor.execute("SELECT * FROM students")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(4001213, 'Kamali', 'Hasan')
(4001231, 'Khorsand Aalam', 'Mohammad Mahdi')
(4011231, 'Ahmadi', 'Sara')
(4011291, 'Fallah', 'Raha')
(4012312, 'Abedi', 'Arezo')
(4013113, 'Zalnezhad', 'Mahdi')
(4021229, 'Rangraz', 'Mohsen')
(4028644, 'Ghasemi', 'Amir')
(8912340, 'Afkhami', 'Behroz')
(9812310, 'Sarmad', 'Sasan')
(9812319, 'Ghasemi', 'Parsa')
(9834110, 'Razaghi', 'Hassan')
(9912310, 'Hatami', 'Mobina')

## دستور های انتخاب‌گر


با استفاده از این دستورات میخوان شی‌ایی خاص از فیلد یا ریکورد خاصی را فراخوانی کرد  -> SELECT

همان گونه که در قبل مشاهده شد دستور زیر برای فراخوانی کل فیلد ها و داده های جدول به کار میرود.


mycursor.execute("SELECT * FROM students")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

## دستور برای انتخاب ستون ها


SELECT name FROM students

In [14]:

mycursor.execute("SELECT FirstName FROM students") #انتخاب از بین  ستون نام ها در جدول دانشجویان

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

('Hasan',)
('Mohammad Mahdi',)
('Bita',)
('Sara',)
('Raha',)
('Ali',)
('Mahdi',)
('Mohsen',)
('Amir',)
('Behroz',)
('Sasan',)
('Parsa',)
('Hassan',)
('Mobina',)

### فراخوانی اولین مقدار با دستور

fetchone()

In [15]:
mycursor.execute("SELECT * FROM students")

myresult = mycursor.fetchone()

print(myresult)

(4001213, 'Kamali', 'Hasan')

## فراخوانی خاص یک قسمت از جدول با ترکیب دستورات -> select, WHERE

### SELECT * FROM students WHERE 

#### در دستور پایین ما تمامی جاهایی که اسم دانشجویان شامل نام مهدی هست را در جدول دانشجویان فراخوانی میکنیم.


##### = ----------    Equal	
##### >	 ----------   Greater than	
##### <	 ----------   Less than	
##### >=   ----------	Greater than or equal	
##### <=    ----------	Less than or equal	
##### <>   ----------  	Not equal. Note: In some versions of SQL this operator may be written as !=	
##### BETWEEN  ---------- Between a certain range	
##### LIKE  ---------- 	Search for a pattern	
##### IN    ----------  برای تعیین چندین مقدار ممکن برای یک ستون

In [23]:
sql = "SELECT * FROM students WHERE SID = 4013113"      #زمانی که دنبال یکی از اعضا با یک صفت خاص میگردیم که در اینجا همان کلید اصلی ماست
sql2 ="SELECT * FROM students WHERE SID > '%80%';"     
sql3 = "SELECT * FROM students WHERE SID LIKE '%402%'"  #زمانی که به دنبال دانشجویانی هستیم که در سال ۱۴۰۲ وارد دانشگاه شد


mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(4013113, 'Zalnezhad', 'Mahdi')

## مرتب کردن نتایج به ترتیب صعودی و نزولی

کلمه کلیدی ORDER BY نتیجه را بصورت صعودی مرتب می کند. برای مرتب کردن نتیجه به ترتیب نزولی، از کلمه کلیدی DESC استفاده کنید

In [24]:
sql = "SELECT * FROM students ORDER BY FirstName"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(4012312, 'Abedi', 'Ali')
(4028644, 'Ghasemi', 'Amir')
(8912340, 'Afkhami', 'Behroz')
(4001391, 'Fallah', 'Bita')
(4001213, 'Kamali', 'Hasan')
(9834110, 'Razaghi', 'Hassan')
(4013113, 'Zalnezhad', 'Mahdi')
(9912310, 'Hatami', 'Mobina')
(4001231, 'Khorsand Aalam', 'Mohammad Mahdi')
(4021229, 'Rangraz', 'Mohsen')
(9812319, 'Ghasemi', 'Parsa')
(4011291, 'Fallah', 'Raha')
(4011231, 'Ahmadi', 'Sara')
(9812310, 'Sarmad', 'Sasan')

In [27]:
sql = "SELECT * FROM students ORDER BY SID DESC"       # سعودی

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(9912310, 'Hatami', 'Mobina')
(9834110, 'Razaghi', 'Hassan')
(9812319, 'Ghasemi', 'Parsa')
(9812310, 'Sarmad', 'Sasan')
(8912340, 'Afkhami', 'Behroz')
(4028644, 'Ghasemi', 'Amir')
(4021229, 'Rangraz', 'Mohsen')
(4013113, 'Zalnezhad', 'Mahdi')
(4012312, 'Abedi', 'Ali')
(4011291, 'Fallah', 'Raha')
(4011231, 'Ahmadi', 'Sara')
(4001391, 'Fallah', 'Bita')
(4001231, 'Khorsand Aalam', 'Mohammad Mahdi')
(4001213, 'Kamali', 'Hasan')

## استفاده از عملگرهای منطقی 

 AND , OR , NOT

In [29]:
sql = "SELECT * FROM students WHERE LastName = 'Fallah' AND SID LIKE '%401%';"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(4011291, 'Fallah', 'Raha')

In [30]:
sql = "SELECT * FROM students WHERE LastName = 'Fallah' AND SID LIKE '%401%' OR SID LIKE '%400%';" # اسفاده از عمگلر یا برای نمایش تمامی ورودی های سال ۱۴۰۰ بعلاوه دانشجویی با قامیلی فلاح ورودی ۱۴۰۱

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(4001213, 'Kamali', 'Hasan')
(4001231, 'Khorsand Aalam', 'Mohammad Mahdi')
(4001391, 'Fallah', 'Bita')
(4011291, 'Fallah', 'Raha')

## OR عملگر

In [32]:
sql = "SELECT * FROM students WHERE LastName = 'Fallah' OR LastName = 'Ghasemi';"  #هرکجا که فایملی دانشجو برابر بود بود فلاح یا قاسمی بهم برگردون 

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(4001391, 'Fallah', 'Bita')
(4011291, 'Fallah', 'Raha')
(4028644, 'Ghasemi', 'Amir')
(9812319, 'Ghasemi', 'Parsa')

## NOT عملگر

In [36]:
sql = "SELECT * FROM students WHERE NOT LastName = 'Fallah';"  # اون داده هایی رو بهم برگردون که فامیلی مساوی با فلاح نباشه


mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(4001213, 'Kamali', 'Hasan')
(4001231, 'Khorsand Aalam', 'Mohammad Mahdi')
(4011231, 'Ahmadi', 'Sara')
(4012312, 'Abedi', 'Ali')
(4013113, 'Zalnezhad', 'Mahdi')
(4021229, 'Rangraz', 'Mohsen')
(4028644, 'Ghasemi', 'Amir')
(8912340, 'Afkhami', 'Behroz')
(9812310, 'Sarmad', 'Sasan')
(9812319, 'Ghasemi', 'Parsa')
(9834110, 'Razaghi', 'Hassan')
(9912310, 'Hatami', 'Mobina')

## دستورات حذف یک  رکورد ها

In [38]:
sql = "DELETE FROM students WHERE FirstName = 'Bita'"

mycursor.execute(sql)

mydb.commit()

print(mycursor.rowcount, "record(s) deleted")

1 record(s) deleted

## دستورات بروزرسانی

In [39]:
sql = "UPDATE students SET FirstName = 'Arezo' WHERE SID = 4012312"

mycursor.execute(sql)

mydb.commit()

print(mycursor.rowcount, "record(s) affected")

1 record(s) affected

In [40]:
mycursor.execute("SELECT * FROM students")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(4001213, 'Kamali', 'Hasan')
(4001231, 'Khorsand Aalam', 'Mohammad Mahdi')
(4011231, 'Ahmadi', 'Sara')
(4011291, 'Fallah', 'Raha')
(4012312, 'Abedi', 'Arezo')
(4013113, 'Zalnezhad', 'Mahdi')
(4021229, 'Rangraz', 'Mohsen')
(4028644, 'Ghasemi', 'Amir')
(8912340, 'Afkhami', 'Behroz')
(9812310, 'Sarmad', 'Sasan')
(9812319, 'Ghasemi', 'Parsa')
(9834110, 'Razaghi', 'Hassan')
(9912310, 'Hatami', 'Mobina')

## دستور محدودیت در نمایش و فراخوانی رکوردها

بطور مثل تا داده پنجم رو برام فراخوانی کن 

یا از داده سوم تا پنج تای بعدش رو بهم نمایش بده -> OFFSET

In [41]:
mycursor.execute("SELECT * FROM students LIMIT 5")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(4001213, 'Kamali', 'Hasan')
(4001231, 'Khorsand Aalam', 'Mohammad Mahdi')
(4011231, 'Ahmadi', 'Sara')
(4011291, 'Fallah', 'Raha')
(4012312, 'Abedi', 'Arezo')

In [45]:
mycursor.execute("SELECT * FROM students LIMIT 5 OFFSET 3")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(4011291, 'Fallah', 'Raha')
(4012312, 'Abedi', 'Arezo')
(4013113, 'Zalnezhad', 'Mahdi')
(4021229, 'Rangraz', 'Mohsen')
(4028644, 'Ghasemi', 'Amir')

NameError: name 'students' is not defined

## ساخت جدول دوم دیتابیس به نام دروس 

در این جدول ما کد دروس و فصل ارائه آن ها را داریم که همچنین این جدول دارای یک کلید اصلی میباشد که همان شماره ایدی دروس است

In [84]:
mycursor.execute("CREATE TABLE courses (CID INT AUTO_INCREMENT PRIMARY KEY, course_name VARCHAR(255), semester VARCHAR(255))")

In [85]:
mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('courses',)
('students',)

## ریختن دیتا و ایجاد رکورد در جدول جدید

In [87]:
sql = "INSERT INTO courses (CID, course_name, semester) VALUES (%s, %s, %s)"

val = [
  ('123321','AI', 'Winter'),
  ('423134','OS', 'Spring'),
  ('324132','Database', 'Summer'),
  ('442123','Programmig', 'Winter'),
  ('159122','ML', 'Summer'),
  ('140121','MV', 'Spring'),
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.")

6 was inserted.

In [88]:
mycursor.execute("SELECT * FROM courses")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(123321, 'AI', 'Winter')
(140121, 'MV', 'Spring')
(159122, 'ML', 'Summer')
(324132, 'Database', 'Summer')
(423134, 'OS', 'Spring')
(442123, 'Programmig', 'Winter')

## ایجاد جدول برداشته ها برای نشان دادن اینکه هر دانشجو چه درسی را انتخاب واحد کرده است

In [89]:
create_table_query = """
CREATE TABLE IF NOT EXISTS Takes (
    ID INT AUTO_INCREMENT PRIMARY KEY,
    SID INT,
    CID INT,
    FOREIGN KEY (SID) REFERENCES students(SID),
    FOREIGN KEY (CID) REFERENCES courses(CID)
)
"""

mycursor.execute(create_table_query)

In [90]:
mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('courses',)
('students',)
('Takes',)

### ریختن دیتا و ایجاد رکورد در جدول جدید

In [93]:
sql = "INSERT INTO Takes (SID, CID) VALUES (%s, %s)"
val = [
  (4001213, 123321),
  (4001231, 123321),
  (9834110, 123321),
  (9912310, 123321),
  (4021229, 324132),
  (4013113, 324132),
  (4012312, 324132),

]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "record(s) inserted.")

7 record(s) inserted.

In [94]:
mycursor.execute("SELECT * FROM Takes")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(1, 4001213, 123321)
(2, 4001231, 123321)
(3, 9834110, 123321)
(4, 9912310, 123321)
(5, 4021229, 324132)
(6, 4013113, 324132)
(7, 4012312, 324132)

## ایجاد جدول نمرات برای دانشجویان

In [100]:
sql = """
CREATE TABLE IF NOT EXISTS Marks (
    ID INT AUTO_INCREMENT PRIMARY KEY,
    Grade FLOAT NOT NULL,
    SID INT,
    CID INT,
    FOREIGN KEY (SID) REFERENCES students(SID),
    FOREIGN KEY (CID) REFERENCES courses(CID)
)
"""

mycursor.execute(sql)

In [101]:
mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('courses',)
('Marks',)
('students',)
('Takes',)

In [102]:
# دستورات INSERT INTO برای ایجاد رکوردها
sql = "INSERT INTO Marks (Grade, SID, CID) VALUES (%s, %s, %s)"
val = [
  (20.0,4001213, 123321),
  (19.24,4001231, 123321),
  (16.10,9834110, 123321),
  (12.0,9912310, 123321),
  (23.50,4021229, 324132),
  (19.75,4013113, 324132),
  (18.23,4012312, 324132),

]

# اجرای دستورات INSERT INTO
mycursor.executemany(sql, val)

# ذخیره تغییرات
mydb.commit()

# چاپ پیام در صورت موفقیت‌آمیز بودن عملیات
print(mycursor.rowcount, "record(s) inserted.")

7 record(s) inserted.

In [104]:
mycursor.execute("SELECT * FROM Marks")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(1, 20.0, 4001213, 123321)
(2, 19.24, 4001231, 123321)
(3, 16.1, 9834110, 123321)
(4, 12.0, 9912310, 123321)
(5, 23.5, 4021229, 324132)
(6, 19.75, 4013113, 324132)
(7, 18.23, 4012312, 324132)

## ایجاد خطا برای درک بهتر

# ***تمرین***
## مشکل خطا را در نمره رکود شماره پنجم حل کنید

In [10]:
sql = "INSERT INTO Marks (Grade, SID, CID) VALUES (%s, %s, %s)"
val = [
  (20.0,1001213, 123321),      #دانشجویی که کد دانشجوییش اشتباه وارد شده    
  (19.24,4001231, 923321),     # درسی که کد درسش به اشتباه وارد سیستم شده
]

# اجرای دستورات INSERT INTO
mycursor.executemany(sql, val)

# ذخیره تغییرات
mydb.commit()

# چاپ پیام در صورت موفقیت‌آمیز بودن عملیات
print(mycursor.rowcount, "record(s) inserted.")

ProgrammingError: 1046 (3D000): No database selected

## بررسی ارور


Cannot add or update a child row: a foreign key constraint fails (`tarbiatmodares`.`marks`, CONSTRAINT `marks_ibfk_1` FOREIGN KEY (`SID`) REFERENCES `students` (`SID`))

شما اجازه اضافه کردن یا اپدیت کردن فرزندان رو ندارن (این داده ها کلید های خارجی از جول های دیگه هستن)

# SQL Key Words

| Keyword | Description | 
|:--------:|:--------:|
|  ALTER TABLE   | Adds, deletes, or modifies columns in a table   |
|  AND  | Only includes rows where both conditions is true   | 
|  ANY   |  Returns true if any of the subquery values meet the condition   |
|  BETWEEN  | 	Selects values within a given range   |
|  CREATE   |   	Creates a database, index, view, table, or procedure     |
|   CREATE TABLE    |    	Creates a new table in the database        |
|   DELETE      | Deletes rows from a table   |
|   DESC    |    Sorts the result set in descending order    |
|   DROP    |    Deletes a column, constraint, database, index, table, or view   |
|   DROP COLUMN   |  Deletes a column in a table   |
|   DROP CONSTRAINT   |   Deletes a UNIQUE, PRIMARY KEY, FOREIGN KEY, or CHECK constraint   |
|   DROP DATABASE     |    Deletes an existing SQL database     |
|   DROP TABLE      |     Deletes an existing table in the database    | 
|    EXISTS	         |      Tests for the existence of any record in a subquery         |
|   FOREIGN KEY     |   A constraint that is a key used to link two tables together     |
|   FROM            |    Specifies which table to select or delete data from        |
|   LIMIT   |     Specifies the number of records to return in the result set   |
|   NOT	   |    Only includes rows where a condition is not true    |
|   NOT NULL	   |        A constraint that enforces a column to not accept NULL values   |
|   OR	|   Includes rows where either condition is true    |
|   ORDER BY	|   Sorts the result set in ascending or descending order   |
|   PRIMARY KEY |   A constraint that uniquely identifies each record in a database table   |
|   SELECT	    |   Selects data from a database    |
|   SELECT INTO	    |   SELECT INTO	    |
|   SET	|   Specifies which columns and values that should be updated in a table    |
|   UPDATE  |   Updates existing rows in a table    |
|   VIEW	|   Creates, updates, or deletes a view     |
|   WHERE	|   Filters a result set to include only records that fulfill a specified condition |